Tekla.Structures.Catalogs.FabricatorProfilesAndMaterials
The FabricatorProfilesAndMaterials class contains methods for converting
fabricator profiles and materials to Tekla Structures.

Tekla.Structures.Catalogs.FabricatorProfilesAndMaterials.ConvertSourceFile(System.String,System.String)
Converts a fabricator profile catalog source file to an XML file that
contains a list of valid Tekla Structures catalog profiles and materials.
profilesFilePath: The path to the fabricator profiles and materials file.
dimensionsFilePath: The path to the fabricator dimensions file.
Returns: True if conversion was successful.